tutorials/neoIcoFoam/cylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

executor        GPU;

allocator       UmpirePool;

memPoolSize     1.0; // requested pool size in GB

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.5e-4;

writeControl    adjustable;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

maxDeltaT       1;


functions
{
    cylinderForceCoeffs
    {
        type      neoForceCoeffs;
        libs      (NeoFOAM);
        patches   (cylinder);
        pName     p;
        rhoInf    1.0;
        pRef      0.0;
        magUInf   1.0;
        lRef      0.1;
        Aref      0.1;
        CofR      (0 0 0);
        dragDir   (1 0 0);
        liftDir   (0 1 0);
    }
}

// ************************************************************************* //
